                                                ARTIFICIAL INTELLIGENCE 
                                                      Assignment - 1 


##### NAME : MANASA VISWANADHAPALLI
##### STUDENT ID : 101114723

# Q.1 
### 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### 2. Import the dataset chipotle.csv

In [2]:
chipo=pd.read_csv('/Users/manasaviswanadhapalli/Downloads/chipotle.csv')

### 3.Assign it to a variable called chipo.

In [3]:
chipo.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  3376 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

In [5]:
chipo['item_price'] = chipo['item_price'].str.replace('$', '')
chipo['item_price'] = chipo['item_price'].astype(float)

/var/folders/cv/nhm546bx0z35dbwdqcs6xqn40000gn/T/ipykernel_11704/2456336170.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chipo['item_price'] = chipo['item_price'].str.replace('$', '')

### 4. How many products cost more than $10.00?

In [6]:
count = (chipo['item_price'] > 10).sum()

print("Number of products that cost more than $10:", count)

Number of products that cost more than $10: 1130

### 5. What is the price of each item?

In [7]:
chipo = chipo[['item_name', 'item_price']]
print(chipo)

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

### 6. Sort by the name of the item

In [8]:
chipo=pd.read_csv('/Users/manasaviswanadhapalli/Downloads/chipotle.csv')
chipo.sort_values(by = "item_name",ascending=True).reset_index(drop=True)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,3389,1360,2,6 Pack Soft Drink,[Diet Coke],$12.98
1,341,148,1,6 Pack Soft Drink,[Diet Coke],$6.49
2,1849,749,1,6 Pack Soft Drink,[Coke],$6.49
3,1860,754,1,6 Pack Soft Drink,[Diet Coke],$6.49
4,2713,1076,1,6 Pack Soft Drink,[Coke],$6.49
...,...,...,...,...,...,...
4617,2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
4618,781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",$8.75
4619,2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",$8.49
4620,1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
4621,1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",$8.49

### 7. What was the quantity of the most expensive item ordered?

In [9]:
chipo[chipo['item_price'] == chipo['item_price'].max()].shape[0]

17

### 8. How many times were a Veggie Salad Bowl ordered?

In [10]:
temp = np.count_nonzero(chipo.item_name == "Veggie Salad Bowl")
print(temp,"times a Veggie Salad Bowl was ordered")

18 times a Veggie Salad Bowl was ordered

### 9.How many times people orderd more than one Canned Soda?

In [11]:
temp1 = np.count_nonzero((chipo.item_name == "Canned Soda") & (chipo.quantity > 1))
print(temp1,"times people orderd more than one Canned Soda")

20 times people orderd more than one Canned Soda

# Q.2 Raw Data

In [12]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### 1.Create the 3 DataFrames based on the raw data in the following cell. Assign each dataframe to a variable called data1, data2, data3.

In [13]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'first_name', 'last_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id','test_id'])

### 2. Join the two dataframes along rows and assign all_data.

In [14]:
all_data = pd.concat([data1, data2])
print(all_data)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### 3. Join the two dataframes along columns and assing to all_data_col.

In [15]:
all_data_col = pd.concat([data1, data2], axis=1)
print(all_data_col)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

### 4. Merge all_data and data3 along the subject_id value.

In [16]:
merged_data = pd.merge(all_data, data3, on='subject_id')
print(merged_data)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

### 5. Merge only the data that has the same 'subject_id' on both data1 and data2.

In [17]:
merged_data_inner = pd.merge(data1, data2, on='subject_id', how='inner')
print(merged_data_inner)

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

### 6. Merge all values in data1 and data2, with matching records from both sides where available.

In [18]:
merged_data_outer = pd.merge(data1, data2, on='subject_id', how='outer')
print(merged_data_outer)

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan